Revit 2027 API
ParameterTypeId.ScheduleFormatParam Property
 "Formatting"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ScheduleFormatParam { get; }
Public Shared ReadOnly Property ScheduleFormatParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ScheduleFormatParam {
	ForgeTypeId^ get ();
}
static member ScheduleFormatParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace